{"data":{"markdownRemark":{"html":"<p>Wieso kann erfassen.ch auf allen Geräten und Bertriebssystemen gleichermassen verwendet werden?<br/><br/></p>\n<p>Weil es sich um eine <strong>Progressive Web App</strong> handelt.<br/><br/></p>\n<p>Progressive Web Apps sind Web-Applikationen, die für Browser entwickelt werden. Weil sie aber einige zusätzliche Anforderungen erfüllen, können sie je länger je weniger von \"normalen\" Apps unterschieden werden. Google und Microsoft (unter anderen) arbeiten zur Zeit heftig daran, dieses Ziel zu erreichen.<br/><br/></p>\n<p>Was ist der Vorteil gegenüber einem \"normalen\" App?</p>\n<ul>\n<li>Es funktioniert auf allen Bertriebssystemen und auf allen Geräten mit modernem Browser</li>\n<li>Sie finden es im Internet (und auf Windows künftig im App-Store). Keine mühsame Suche im App-Store</li>\n<li>Sie müssen es nicht installieren. Die App installiert sich selbst, wenn Sie die Webseite besuchen</li>\n<li>Sie müssen keine Updates installieren. Das geht ganz von alleine</li>\n</ul>\n<p>Ist Ihnen aufgefallen, dass Apple oben nicht erwähnt wurde? Tja, die wollen ihr Geld mit dem App-Store verdienen. Apple führt die für Progressive Web Apps nützlichen Technologien auffällig langsam ein. Daher funktionieren Progressive Web Apps auf Android und Windows besser als auf MacOS und iOS. Trotzdem funktionieren Progressive Web Apps auch auf Apple-Geräten. Sie sind eben auch eine Web-App.</p>","frontmatter":{"date":"04.10.2018","path":"/Technische-Dokumentation/PWA","title":"Progressive Web App"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Wieso kann erfassen.ch auf allen Geräten und Bertriebssystemen gleichermassen verwendet werden? Weil es sich um eine  Progressive Web App  handelt. Progressive Web Apps sind Web-Applikationen, die für Browser entwickelt werden. Weil sie aber einige…","id":"56e246c6-3d08-59a2-a0ae-8076ebd1ea2a","frontmatter":{"title":"Progressive Web App","date":"04.10.2018","path":"/Technische-Dokumentation/PWA"}}},{"node":{"excerpt":"Ihre Daten liegen in  CouchDB . Die Spezialität von CouchDB ist  Synchronisieren . Um CouchDB herum ist eine ganzes Ökosystem von Werkzeugen entstanden. Zwei davon werden von erfassen.ch verwendet: PouchDB : JavaScript-Version von CouchDB RxDB : Baut…","id":"8f5c876e-5afa-5c68-afad-a021e5779b74","frontmatter":{"title":"Datenbank","date":"04.10.2018","path":"/Technische-Dokumentation/Datenbank"}}},{"node":{"excerpt":"This document describes how creating, editing and deleting users and projects is managed. \nIt's rather cryptic and probably most useful for myself. Inspired by  PouchDB's docs . 1. user create app-side user clicks menu to create account pouchdb…","id":"980960d7-341d-5603-b70e-3cc2f070ff6a","frontmatter":{"title":"User und Projekte verwalten","date":"01.10.2018","path":"/Technische-Dokumentation/User-und-Projekte-verwalten"}}},{"node":{"excerpt":"This document describes what happens on login app-side. Based on  PouchDB's plugin . if cookie is still valid, need not log in \nelse:  pouchdb.logIn create userDoc collection sync userDoc collection extract project list from userDoc loop projects…","id":"48e4b448-144e-5d92-829d-9a537d4241d4","frontmatter":{"title":"Login","date":"01.10.2018","path":"/Technische-Dokumentation/Login"}}},{"node":{"excerpt":"Sie finden den Code von erfassen.ch in zwei Repositorien auf GitHub: erfassen : Die App, die Sie jetzt vor sich haben erfassen_daemon : Verwaltet im Hintergrund Konten und Projekte erfassen.ch ist  open source . Sie können daher in obigen…","id":"46b7d522-bfb3-5587-9e04-c30fe0385b55","frontmatter":{"title":"GitHub","date":"04.10.2018","path":"/Technische-Dokumentation/GitHub"}}}]}},"pageContext":{}}